{"professors":[{"name":{"first":"Andrew G.","last":"Barto"},"email":"barto@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"https://people.cs.umass.edu/~barto/","webpage":"https://www.cics.umass.edu/faculty/directory/barto_andrew","interests":"Learning in machines and animals; theories and models of motivation, reward, and addiction from psychology, neuroscience, and artificial intelligence; reinforcement learning theory and applications; fairness and safety of reinforcement learning applications.","research":"Professor Barto's research centers on learning in natural and artificial systems. His current research focuses on connections between reinforcement learning and neuroscience, with particular focus on the nature of reward signals in the brain and biologically plausible methods for artificial neural network learning.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"barto-andrew g.","courses":[]},{"name":{"first":"Emma","last":"Anderson"},"email":"emmaanderson@cics.umass.edu","phone":"(413) 577-0050","tags":[],"office":"228 CS Building","website":null,"webpage":"https://www.cics.umass.edu/people/anderson-emma","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"anderson-emma","courses":[]},{"name":{"first":"Ivon","last":"Arroyo"},"email":"ivon@cs.umass.edu","phone":null,"tags":[],"office":"A259 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/arroyo-ivon","interests":"Multimedia learning, wearable and mobile devices for learning, mathematics education, computer science education, development of abstract thought, K-12, affect and learning, culturally-congruent technologies for learning, instructional strategy, didactics in learning systems, learning with novel technologies, intelligent tutoring systems, personalized learning systems, individual differences, learner characteristics and learning, educational data mining, and student modeling.","research":"A true hybrid across disciplines, Ivon Arroyo specializes in learning sciences, computer science, and educational/cognitive psychology. Her expertise is in the design of novel technologies for learning and assessment for K-12 students studying mathematics.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"arroyo-ivon","courses":[]},{"name":{"first":"Jeannie","last":"Albrecht"},"email":"jeannie@cs.williams.edu","phone":null,"tags":[],"office":null,"website":"http://www.cs.williams.edu/~jeannie/","webpage":"https://www.cics.umass.edu/people/albrecht_jeannie","interests":"Design and performance of distributed systems and computer networks, particularly\nfocusing on reliability, scalability, and extensibility achieved over the wide-area.","research":"Professor Albrecht is currently working on the Global Environment for Network Innovations (GENI) project sponsored by the National Science Foundation. She is Co-chair for the GENI Working Group on Experiment Workflow and Services.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"albrecht-jeannie","courses":[]},{"name":{"first":"George","last":"Avrunin"},"email":"avrunin@cs.umass.edu","phone":"(413) 545-4251","tags":[],"office":"316A CS Building","website":"http://ext.math.umass.edu/~avrunin/","webpage":"https://www.cics.umass.edu/people/avrunin_george","interests":"Concurrency, testing and analysis, real-time, cohomology of finite groups.","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"avrunin-george","courses":[]},{"name":{"first":"Rick","last":"Adrion"},"email":"adrion@umass.edu","phone":"(413) 545-2475","tags":[],"office":"224A CS Building","website":"https://sites.google.com/view/rickadrionswebsite","webpage":"https://www.cics.umass.edu/faculty/directory/adrion_richards","interests":"CS Education research; CS Education policy and models for state and local change; impact of instructional technology on teaching and learning; history of computing and information sciences, and applications and models for technology transfer and diffusion.","research":"After a long career in software engineering, analysis and testing, Professor Adrion's current research interests are in equity, diversity and inclusion; pedagogy and technologies for computer science teaching and learning, automatic capture and indexing of active classroom activities, multimedia authoring tools, and constructivist learning environments. Adrion has led a number of large regional and national programs, including the Commonwealth Information Technology Initiative (CITI) 2003–2006, the Commonwealth Alliance for Information Technology Education (CAITE) 2006–2012, and the Expanding Computing Education Pathways Alliance from 2011–2019.","activities":[],"rating":2.7,"difficulty":3,"reviews":3,"id":"adrion-rick","courses":[]},{"name":{"first":"Emery","last":"Berger"},"email":"emery@cs.umass.edu","phone":"(413) 577-4211","tags":[],"office":"378 CS Building","website":"http://emeryberger.com","webpage":"https://www.cics.umass.edu/faculty/directory/berger_emery","interests":"Programming languages, runtime systems, and operating systems, with a particular focus on systems that transparently improve reliability, security, and performance.","research":"Professor Berger's research spans programming languages, runtime systems, and operating systems, with a particular focus on systems that transparently improve reliability, security, and performance. He is the creator of a number of influential software systems including Hoard, a fast and scalable memory manager that accelerates multithreaded applications (used by companies including British Telecom, Cisco, Credit Suisse, Reuters, Royal Bank of Canada, SAP, and Tata, and on which the Mac OS X memory manager is based); DieHard, an error-avoiding memory manager that directly influenced the design of the Windows 7 Fault-Tolerant Heap; and DieHarder, a secure memory manager that was an inspiration for hardening changes made to the Windows 8 heap.","activities":[],"rating":2,"difficulty":4.2,"reviews":20,"id":"berger-emery","courses":[]},{"name":{"first":"W. Bruce","last":"Croft"},"email":"croft@cs.umass.edu","phone":"(413) 545-0463","tags":[],"office":"368 CS Building","website":"http://www.cs.umass.edu/~croft","webpage":"https://www.cics.umass.edu/faculty/directory/croft_w-bruce","interests":"Information retrieval and search engines.","research":"Professor Croft's research interests are in many areas of information retrieval, including retrieval models, representation, Web search, query processing, cross-lingual retrieval, and search architectures. He has published more than 250 articles on these and other subjects. His h-index is 100 according to his Google Scholar profile. He has been involved in the organization of many workshops and conferences and has given many keynote presentations. Through the joint Lemur Project with CMU, his group has provided open-source search engines and research tools to many in the academic and industrial IR community.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"croft-w. bruce","courses":[]},{"name":{"first":"James","last":"Allan"},"email":"allan@cs.umass.edu","phone":"(413) 545-3240","tags":[],"office":"370 CS Building","website":"https://www.cs.umass.edu/~allan/","webpage":"https://www.cics.umass.edu/faculty/directory/allan_james","interests":"Information retrieval, event-based information organization, controversy and misinformation detection.","research":"Professor Allan's research focuses on information retrieval, event-based information organization, as well as minimally interactive retrieval and organization. He also explores how novelty can be incorporated into retrieval algorithms, techniques for querying across languages, and methods for recognizing controversial or misleading information in text on the internet.","activities":[],"rating":4.1,"difficulty":3.6,"reviews":31,"id":"allan-james","courses":[]},{"name":{"first":"David","last":"Barrington"},"email":"barring@cs.umass.edu","phone":"(413) 545-4329","tags":[],"office":"210 CS Building","website":"http://www.cs.umass.edu/~barring/","webpage":"https://www.cics.umass.edu/faculty/directory/barrington_david","interests":"Complexity of computation, circuit complexity, boolean function complexity, theory of automata, mathematical logic, theory of algorithms.","research":"Professor Barrington's current research is in complexity theory, examining the resources needed by various abstract computing devices, both sequential and parallel, to solve various mathematical problems. In particular, Professor Barrington has discovered new relationships between combinatorial complexity (circuits and branching programs), the theory of finite automata and definability by first-order logic.","activities":[],"rating":3.5,"difficulty":4.3,"reviews":104,"id":"barrington-david","courses":[]},{"name":{"first":"Gordon","last":"Anderson"},"email":"gordon@cs.umass.edu","phone":"(413) 545-4747","tags":[],"office":"A349B LGRC","website":"https://www.cs.umass.edu/~gordon/","webpage":"https://www.cics.umass.edu/faculty/directory/anderson_gordon","interests":"","research":"","activities":[],"rating":3,"difficulty":3.1,"reviews":84,"id":"anderson-gordon","courses":[]},{"name":{"first":"Ina","last":"Fiterau Brostean"},"email":"mfiterau@cs.umass.edu","phone":"(413) 577-0064","tags":[],"office":"222 CS Building","website":"http://www.cs.umass.edu/~mfiterau","webpage":"https://www.cics.umass.edu/people/fiterau-brostean-ina","interests":"Machine learning, Ensembles, Multimodal data fusion, Hybrid models, Healthcare applications.","research":"Ina aims to build hybrid systems that learn expressive representations of multimodal, heterogeneous data for predictive models designed to interact with human users. My current research revolves around hybrid methods for multimodal data, especially data from the healthcare domain. Ongoing projects: (1) Modeling disease trajectories and forecasting clinical outcomes by integrating multi-resolution, irregularly-sampled time series and images; (2) Weakly-supervised Transfer Learning of Models and Representations; (3) Online Adaptive Policies for Representation Learning.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"fiterau brostean-ina","courses":[]},{"name":{"first":"Fran","last":"Berman"},"email":"fberman@umass.edu","phone":null,"tags":[],"office":"336 CS Building","website":"https://people.cs.umass.edu/~fberman/","webpage":"https://www.cics.umass.edu/people/berman-fran","interests":"Public Interest Technology, Data Stewardship and Cyberinfrastructure, Internet of Things, Social impacts of Technology","research":"Berman is a data scientist whose work focuses on the social and environmental impacts of information technology, and in particular of the Internet of Things (IoT) -- a deeply interconnected ecosystem of billions of devices and systems that are transforming commerce, science and society. Berman's research focuses on the overarching ecosystem needed to guide the development of information technologies that maximize benefits, minimize risks, and promote individual protections, the public interest, and planetary responsibility.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"berman-fran","courses":[]},{"name":{"first":"Bruno","last":"Castro da Silva"},"email":"bsilva@cs.umass.edu","phone":null,"tags":[],"office":"278 CS Building","website":"https://people.cs.umass.edu/~bsilva/","webpage":"https://www.cics.umass.edu/people/castro-da-silva-bruno","interests":"Reinforcement learning, decision making, robotics, and AI safety.","research":"Professor da Silva is interested in designing reinforcement learning (RL) algorithms that can solve large sets of diverse real-life problems, while ensuring that the learning process is safe according to criteria defined by a designer. To achieve this goal, his research focuses primarily on two key problems: (1) how to design general-purpose RL algorithms capable of autonomously decomposing complex tasks into simpler sub-problems, for which specialized reusable and composable skills be can be learned; and (2) how to ensure that these skills are learned in a way that meets user-specified safety requirements with high probability. These are fundamental questions that underlie the gap between what artificial intelligence agents can - in principle - do and what we can effectively get them to do given our current algorithms. \nThe ultimate goal of Professor da Silva's work is to design the necessary tools so that reinforcement learning algorithms can be widely used to solve challenging real-world tasks in homes and in the workplace, in a safe way, and with as little human intervention as possible. \nMore broadly, Professor da Silva's research interests lie in the intersection of machine learning, reinforcement learning, optimal control theory, and robotics, and include the construction of hierarchical policies, active learning, open-ended learning, biologically-plausible intrinsic motivation mechanisms, Bayesian optimization applied to control, and machine learning algorithms with high-probability safety and fairness guarantees.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"castro da silva-bruno","courses":[]},{"name":{"first":"Marvin","last":"Cable"},"email":"mcable@cs.umass.edu","phone":null,"tags":[],"office":"A246 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/cable-marvin","interests":"","research":"","activities":[],"rating":4.6,"difficulty":3.4,"reviews":5,"id":"cable-marvin","courses":[]},{"name":{"first":"George","last":"Bissias"},"email":"gbiss@cs.umass.edu","phone":null,"tags":[],"office":"272 CS Building","website":"https://people.cs.umass.edu/~gbiss/","webpage":"https://www.cics.umass.edu/people/bissias-george","interests":"Distributed systems and databases, cryptocurrencies, and network and data privacy.","research":"George's ongoing research creates systems for secure, large-scale data processing and analysis. He also develops and analyzes cryptocurrency protocols such as Bitcoin.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"bissias-george","courses":[]},{"name":{"first":"Joe","last":"Chiu"},"email":"joechiu@cs.umass.edu","phone":null,"tags":[],"office":"A255 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/chiu-joe","interests":"Program phases, performance measurement and optimization, garbage collection.","research":"Program phase detection and prediction, dynamic CPU clock frequency adjustment, garbage collection, mobile computing.","activities":[],"rating":3,"difficulty":4,"reviews":72,"id":"chiu-joe","courses":[]},{"name":{"first":"Jaime","last":"Dávila"},"email":"jaimedavila@umass.edu","phone":null,"tags":[],"office":"A137 LGRC","website":"https://people.cs.umass.edu/~jaimedavila/","webpage":"https://www.cics.umass.edu/people/davila-jaime","interests":"Deep Learning, Neural Networks, Machine Learning, Artificial Intelligence, the Open Software Movement, Big Data and Privacy, Dialogic Techniques, the effect of different curricula and approaches on Introductory Computer Science courses.","research":"Most recently, Jaime had been working on replicating human morpho-semantic transformation with deep learning neural networks. Jaime is currently analyzing the way in which these networks meet their intended tasks in order to illuminate how humans might be performing them. He has also been evolving neural networks to solve agent-based competitive games under dynamic environmental conditions.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"dávila-jaime","courses":[]},{"name":{"first":"Toby","last":"Bloom"},"email":"toby@tobybloom.com","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/people/bloom-toby","interests":"Bioinformatics, Data Visualization, Multi-modal data integration, Data Warehousing of complex data","research":"Professor Bloom's research is in the area of bioinformatics.   Her current interests are in multi-modal data integration, analysis, and visualization of genomic and clinical data. A focus has been bringing the tools of data analysis to the genomic scientists and biologists without computational expertise, who are working with very large and complex genomic data sets.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"bloom-toby","courses":[]},{"name":{"first":"Amir","last":"Houmansadr"},"email":"amir@cs.umass.edu","phone":"(413) 577-2580","tags":[],"office":"206 CS Building","website":"https://cs.umass.edu/~amir/","webpage":"https://www.cics.umass.edu/faculty/directory/houmansadr_amir","interests":"Privacy-Enhancing Technologies, Network Security, Adversarial Machine Learning","research":"Amir's research group evaluates the privacy of in-the-wild Internet services, such as messaging applications, IoT devices, and machine learning APIs,  and designs and implements tools to enhance the privacy of Internet users, such as anti-censorship systems. To this end, Amir's research group combines the development of practical systems with rigorous theoretical analysis, and incorporates techniques from various disciplines such as computer networking, cryptography, and information theory. The specific problems his research group is currently exploring include Internet censorship resistance, network traffic analysis, covert communications, and machine learning security and privacy. Amir's research has found flaws in popular privacy-preserving tools, and has led to the advent of novel designs to overcome these problems.","activities":[],"rating":4.3,"difficulty":2.4,"reviews":7,"id":"houmansadr-amir","courses":[]},{"name":{"first":"Jeffrey","last":"Hamalainen"},"email":"jhamalainen@umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/people/hamalainen-jeffrey","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"hamalainen-jeffrey","courses":[]},{"name":{"first":"Lori","last":"Clarke"},"email":"clarke@cs.umass.edu","phone":"(413) 545-1328","tags":[],"office":"316A CS Building","website":"http://laser.cs.umass.edu/people/clarke.html","webpage":"https://www.cics.umass.edu/faculty/directory/clarke_lori","interests":"Dr. Clarke's research is in the area of software engineering, primarily focusing on model checking of concurrent systems and requirements engineering. Recently she has been investigating applying software engineering technologies to detect errors and vulnerabilities in complex, human-intensive processes in domains such as healthcare, scientific workflow, and digital government. She is also involved in several efforts to increase participation of underrepresented groups in computing research.","research":"","activities":[],"rating":2.1,"difficulty":2.5,"reviews":6,"id":"clarke-lori","courses":[]},{"name":{"first":"Yanlei","last":"Diao"},"email":"yanlei.diao@polytechnique.edu","phone":"(413) 545-1135","tags":[],"office":null,"website":"http://www.cs.umass.edu/~yanlei/","webpage":"https://www.cics.umass.edu/faculty/directory/diao_yanlei","interests":"Information architectures, data streams, data dissemination, XML query pro-cessing, and learning-based data processing.","research":"Professor Diao's research interests are Information architectures, data streams, data dissemination, XML query pro-cessing, and learning-based data processing.","activities":[],"rating":1,"difficulty":2.5,"reviews":2,"id":"diao-yanlei","courses":[]},{"name":{"first":"Paul","last":"Dickson"},"email":"pdickson@ithaca.edu","phone":null,"tags":[],"office":null,"website":"https://faculty.ithaca.edu/pdickson/","webpage":"https://www.cics.umass.edu/people/dickson-paul","interests":"","research":"Professor Dickson's work focuses on computer science pedagogy using image processing techniques to facilitate capture of lecture material and to automatically turn that material into indexed multimedia presentations. This work is part of the Presentations Automatically Organized from Lectures (PAOL) project which is currently being run in collaboration with the University of Massachusetts Amherst.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"dickson-paul","courses":[]},{"name":{"first":"Yuriy","last":"Brun"},"email":"brun@cs.umass.edu","phone":"(413) 577-0233","tags":[],"office":"302 CS Building","website":"http://people.cs.umass.edu/~brun","webpage":"https://www.cics.umass.edu/faculty/directory/brun_yuriy","interests":"Software engineering and systems research, focusing on software fairness and bias, self-adaptive systems, and distributed systems.","research":"Professor Brun's research focuses on making it easier to build and deploy software systems, and ensuring that they abide by desirable behavioral constraints. His research is centered around automation and software behavior. He develops techniques that automatically enforce behavior on systems, automatically mine behavioral models of software to help developers understand system behavior, and automatically repair systems to satisfy the behavioral requirements imposed on them. He works closely with developers to understand the challenges they face and to build tools to help them. He works closely with systems to understand where they go wrong and how to automate preventing that from happening. The long-term goal of this research is self-adaptive systems that self-monitor, self-manage, and self-correct their own behavior to achieve high-level goals in dynamic, constrained environments.  Focusing on software fairness, Professor Brun has developed automated techniques to test software, particularly software that uses machine learning or other data mining methods, for bias, and to help enforce fairness constraints during the learning process.","activities":[],"rating":4.8,"difficulty":3,"reviews":5,"id":"brun-yuriy","courses":[]},{"name":{"first":"Joydeep","last":"Biswas"},"email":"joydeepb@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://joydeepb.com","webpage":"https://www.cics.umass.edu/people/biswas-joydeep","interests":"Robot Perception, Motion Planning, Control Systems, AI, Deployed Robot Systems","research":"My ultimate goal is to have self-sufficient autonomous mobile robots working in human environments, performing tasks accurately and robustly. In support of this goal, I am interested in research in perception, planning, and control applied to autonomous mobile robots. My research in perception involves developing models and representations for a dynamic world, and algorithms to build and perform inference based on such models. My interests in planning include motion planning, multi-robot coordination, and task-based planning in domains including service mobile robots, and robot soccer.","activities":[],"rating":1.7,"difficulty":3.9,"reviews":13,"id":"biswas-joydeep","courses":[]},{"name":{"first":"Erik","last":"Learned-Miller"},"email":"elm@cs.umass.edu","phone":"(413) 545-2742","tags":[],"office":"202 CS Building","website":"http://www.cs.umass.edu/~elm/","webpage":"https://www.cics.umass.edu/faculty/directory/learned-miller_erik","interests":"Computer vision and machine learning. Deep learning. Probabilistic and statistical methods in vision and image processing. Non-parametric and distribution-free statistics. Information theoretic methods. Unsupervised and semi-supervised learning. Low-shot learning.","research":"Professor Learned-Miller's interests can be broadly categorized as applying ideas and methods from machine learning to problems in computer vision. His research has included work on the following problems: learning from one example (one-shot learning), face recognition and face detection, segmentation of moving objects in video, algorithms for the joint alignment of unlabeled images, and text recognition. He has produced some of the most widely used benchmarks in face recognition research, including Labeled Faces in the Wild and the Face Detection Database and Benchmark. His current work focuses on unsupervised, self-supervised, and semi-supervised learning, and on mechanisms for regulating face recognition technology.","activities":[],"rating":1.6,"difficulty":3.3,"reviews":13,"id":"learned-miller-erik","courses":[]},{"name":{"first":"Justin","last":"Domke"},"email":"domke@cs.umass.edu","phone":"(413) 545-4032","tags":[],"office":"208 CS Building","website":"https://people.cs.umass.edu/~domke/","webpage":"https://www.cics.umass.edu/faculty/directory/domke-justin","interests":"Machine Learning, Probabilistic Graphical Models, Convex Optimization, Structured Learning","research":"The world is full of uncertainty and explicitly modeling and reasoning about this uncertainty is often helpful in making predictions. Professor Domke's research focuses on two related issues: the computational challenges this reasoning presents, and how to make methods work well when the phenomena being modeled is too complex to be modeled exactly. Specifically, he works on algorithms for better reasoning in probabilistic graphical models, how to learn when using an approximate reasoning algorithm, and integrating probabilistic models with other machine learning tools to help address problems too complex to model exactly. Often these algorithms are inspired by problems in computer vision.","activities":[],"rating":2,"difficulty":3.6,"reviews":19,"id":"domke-justin","courses":[]},{"name":{"first":"Gerome","last":"Miklau"},"email":"miklau@cs.umass.edu","phone":"(413) 545-4032","tags":[],"office":"304 CS Building","website":"http://www.cs.umass.edu/~miklau/","webpage":"https://www.cics.umass.edu/faculty/directory/miklau_gerome","interests":"Database research with an emphasis on privacy and security; database theory; semi-structured data.","research":"Professor Miklau's research interests are in the area of Database research with an emphasis on security; database theory; semi-structured data. The objective of his research is to enable secure and trustworthy data management in both conventional database systems and distributed environments like the World Wide Web. His work focuses on classical security concerns such as confidentiality, privacy, and integrity of data.","activities":[],"rating":4,"difficulty":3.3,"reviews":15,"id":"miklau-gerome","courses":[]},{"name":{"first":"Chuang","last":"Gan"},"email":"chuangg@cics.umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/people/gan-chuang","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"gan-chuang","courses":[]},{"name":{"first":"Weibo","last":"Gong"},"email":"gong@cics.umass.edu","phone":"(413) 545-0384","tags":[],"office":null,"website":"http://www-unix.ecs.umass.edu/~gong/","webpage":"https://www.cics.umass.edu/faculty/directory/gong_weibo","interests":"Complex modeling and control and communication security.","research":"RESEARCH PROJECTS OF CSMCL:","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"gong-weibo","courses":[]},{"name":{"first":"Patrick","last":"Flaherty"},"email":"pflaherty@umass.edu","phone":"(413) 545-1796","tags":[],"office":"1444 LGRT","website":"http://www.math.umass.edu/directory/faculty/patrick-flaherty","webpage":"https://www.cics.umass.edu/people/flaherty-patrick","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"flaherty-patrick","courses":[]},{"name":{"first":"Xian","last":"Du"},"email":"xiandu@umass.edu","phone":"(413) 577-0941","tags":[],"office":"S421 Life Science Laboratories","website":"https://mie.umass.edu/faculty/xian-du","webpage":"https://www.cics.umass.edu/people/du-xian","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"du-xian","courses":[]},{"name":{"first":"Phillipa","last":"Gill"},"email":"phillipa@cs.umass.edu","phone":"(413) 545-3217","tags":[],"office":null,"website":"https://people.cs.umass.edu/~phillipa/","webpage":"https://www.cics.umass.edu/faculty/directory/gill-phillipa","interests":"Computer networking and security, network measurement, network interference, and reliability with a focus on designing tools and techniques to detect and mitigate network interference on the Internet. She also informs her work by interacting with the relevant stakeholders in related disciplines (e.g., law, political science) and the network operator community.","research":"Professor Gill's work focuses on many aspects of computer networking and security with a focus on designing novel network measurement techniques to understand online information controls, network interference, and interdomain routing. She leads the ICLab project which is working to develop a network measurement platform specifically for online information controls.","activities":[],"rating":0,"difficulty":0,"reviews":0,"id":"gill-phillipa","courses":[]},{"name":{"first":"David","last":"Smith"},"email":"dasmith@ccs.neu.edu","phone":null,"tags":[],"office":null,"website":"http://www.ccs.neu.edu/home/dasmith/","webpage":"https://www.cics.umass.edu/faculty/directory/smith_david","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"smith-david","courses":[]},{"name":{"first":"Jane","last":"Fountain"},"email":"jfountai@umass.edu","phone":"(413) 545-1007","tags":[],"office":null,"website":"http://people.umass.edu/jfountai/","webpage":"https://www.cics.umass.edu/faculty/directory/fountain_jane","interests":"Organization theory, information technology and politics, economic sociology, public policy, political sociology, gender, and science, technology and society.","research":"Professor Fountain is the founder and Director of the National Center for Digital Government , based at UMass Amherst, which was established with support from the National Science Foundation to build research and infrastructure for the emerging field of research on technology and governance. The National Center has sponsored research workshops, seminars, doctoral fellowships and visiting researchers from around the world in addition to its active research programs. Professor Fountain also directs the new Science, Technology and Society Initiative, a campus-wide effort at UMass Amherst. The STS Initiative serves as a catalyst for research partnerships between social, natural and physical scientists on campus and beyond. It is designed to build social science, policy and cross-disciplinary research on the range of social, political and economic challenges and research questions posed by emerging technologies. Fountain is a Senior Researcher at the Center for Hierarchical Manufacturing, principal investigator of the International Dimensions of Ethics in Science and Engineering project (IDEESE) and co-principal investigator of the Commonwealth Alliance for Information Technology Education (CAITE). Fountain also directs the Women in the Information Age Project , which was established with a gift from PriceWaterhouseCoopers. This project examines the participation of women in computing and information-technology related fields and, with its partner institutions, seeks to increase the number of women experts in information and communication technologies.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"fountain-jane","courses":[]},{"name":{"first":"Jeremy","last":"Gummeson"},"email":"gummeson@cs.umass.edu","phone":null,"tags":[],"office":"211C Knowles Engineering Building","website":"https://www.linkedin.com/in/jeremy-gummeson-1755a8b/","webpage":"https://www.cics.umass.edu/people/gummeson-jeremy","interests":"Wearable computing, Energy harvesting, RFID systems, backscatter communication, Green computing, Wireless sensor networks.","research":"Jeremy's current research spans several areas including energy harvesting wearable devices, backscatter communication systems, distributed wireless sensing, optimizations for home-scale green computing, and low power environmental sensors.","activities":[],"rating":5,"difficulty":3.3,"reviews":7,"id":"gummeson-jeremy","courses":[]},{"name":{"first":"Roderic","last":"Grupen"},"email":"grupen@cs.umass.edu","phone":"(413) 545-3280","tags":[],"office":"A337 LGRC","website":"http://www-robotics.cs.umass.edu/~grupen/home.html","webpage":"https://www.cics.umass.edu/faculty/directory/grupen_roderic","interests":"Autonomous sensorimotor systems, developmental robotics, robot learning, mobile manipulation, dexterous mobility and manipulation, robot hands, tactile sensing, cognitive robotics, embedded control signal interpretation","research":"Professor Grupen conducts research on embodied intelligent systems by integrating mechanisms, control theory, machine learning, and cognitive processing. His laboratory builds dexterous machines that develop in a manner inspired by infant human development and that write their own programs and knowledge structures. Grupen and his students are currently working on personal robots for health care applications, robots designed to explore other planets, robots that learn how to work along side humans, and field robotics systems. His approach relies on structuring the search for behavior by expressing the intrinsic dynamics of physical processes and acquiring policies for robot control tasks using on-line reinforcement learning. The Laboratory for Perceptual Robotics uses this framework as the basis for a computational model of sensorimotor development in humans and machines.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"grupen-roderic","courses":[]},{"name":{"first":"Allen R.","last":"Hanson"},"email":"hanson@cs.umass.edu","phone":null,"tags":[],"office":"A231 LGRC","website":"http://vis-www.cs.umass.edu/~hanson/home.html","webpage":"https://www.cics.umass.edu/faculty/directory/hanson_allen","interests":"Computer vision, image interpretation, mobile robotics, aerial image analysis, motion, stereo, 3-D reconstruction, sensor calibration, education.","research":"Professor Hanson's research reflects a broad interest in computer vision and visual information processing, including knowledge-based image understanding, analysis of motion sequences, autonomous vehicle navigation, and parallel architectures for computer vision. Emphasis on practical systems is supported by research on databases for visual image processing, photo-interpretation of aerial images, biomedical image analysis, automated robotic manufacturing and assembly, real-time control of intelligent vehicles, and development environments for vision research.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"hanson-allen r.","courses":[]},{"name":{"first":"Hui","last":"Guan"},"email":"huiguan@cs.umass.edu","phone":null,"tags":[],"office":"A217D LGRC","website":"https://guanh01.github.io/","webpage":"https://www.cics.umass.edu/people/guan-hui","interests":"Programming Systems, Machine Learning, Deep Learning, High Performance Computing","research":"Guan's research lies in the intersection of machine mearning and programming systems. Her current research focuses on improving machine learning (e.g., speed, scalability, reliability) through innovations in algorithms and programming systems (e.g., compilers, runtime). She is also interested in leveraging machine learning to improve high-performance computing.","activities":[],"rating":2.5,"difficulty":2.9,"reviews":8,"id":"guan-hui","courses":[]},{"name":{"first":"Peter","last":"Haas"},"email":"phaas@cs.umass.edu","phone":"(413) 545-3140","tags":[],"office":"204 CS Building","website":"https://people.cs.umass.edu/~phaas","webpage":"https://www.cics.umass.edu/people/haas-peter","interests":"Information management; mining, analytics, and exploration of massive data; probabilistic database systems; machine learning; modeling and computer simulation of complex stochastic systems.","research":"Professor Haas' research centers on the application of techniques from applied probability and statistics to the design, performance analysis, and control of systems for information management, mining, integration, exploration, learning, and optimization. Other projects focus on techniques for modeling, simulation, design, and control of complex systems, especially discrete-event stochastic systems, as well as on the interface of simulation and information management.","activities":[],"rating":4.5,"difficulty":4,"reviews":11,"id":"haas-peter","courses":[]},{"name":{"first":"Przemek","last":"Grabowicz"},"email":"grabowicz@cs.umass.edu","phone":"(413) 577-1506","tags":[],"office":"362 CS Building","website":"https://people.cs.umass.edu/~grabowicz","webpage":"https://www.cics.umass.edu/people/grabowicz-przemek","interests":"Fair and explainable machine learning, computational social science, social computing systems, network science, causality.","research":"Professor Grabowicz's research contributes statistical methods to understand and augment fundamental social processes in systems of our information society. The ambition of his research is to design fair and representative social computing systems, such as rating systems in social media, predictive models of human decision-making, and recommender systems. Important questions concerning the design of these systems include: how to train non-discriminatory machine learning models and how to prevent biases in social evaluations? Professor Grabowicz studies fairness, social influence, group formation, information diffusion, and information processing using multilevel probabilistic graphical models, information theory, network science, and causal inference.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"grabowicz-przemek","courses":[]},{"name":{"first":"David","last":"Irwin"},"email":"irwin@ecs.umass.edu","phone":"(413) 545-5822","tags":[],"office":null,"website":"http://www.ecs.umass.edu/~irwin/","webpage":"https://www.cics.umass.edu/faculty/directory/irwin_david","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"irwin-david","courses":[]},{"name":{"first":"Wendy G.","last":"Lehnert"},"email":"lehnert@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://www.cs.umass.edu/~lehnert/","webpage":"https://www.cics.umass.edu/faculty/directory/lehnert_wendy","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"lehnert-wendy g.","courses":[]},{"name":{"first":"Victor R.","last":"Lesser"},"email":"lesser@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://mas.cs.umass.edu/lesser.html","webpage":"https://www.cics.umass.edu/faculty/directory/lesser_victor","interests":"Multi-agent systems, agents, real-time decision making, information gathering, situation assessment and interpretation of sensory data.","research":"Professor Lesser's major research focus is on the control and organization of complex AI systems. Professor Lesser is considered a leading researcher in the areas of Multi-Agent Systems/Distributed AI, Intelligent Distributed Sensor Networks, Real-time AI, and Blackboard Systems. He has also made contributions in the areas of speech and sound understanding, diagnostics, adaptive signal processing, intelligent user interfaces, and computer architecture.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"lesser-victor r.","courses":[]},{"name":{"first":"Donghyun","last":"Kim"},"email":"donghyunkim@cs.umass.edu","phone":null,"tags":[],"office":"A325 LGRC","website":"https://groups.cs.umass.edu/daros","webpage":"https://www.cics.umass.edu/people/kim-donghyun","interests":"Robotics, Legged Locomotion, Dynamics and Control, Vision Sensing, Machine Learning","research":"Donghyun has been focusing on developing control architectures for dynamic legged robots. He emphasizes the experimental validation of the developed formulations and the discussion of fundamental problems in robotic systems operating in the real physical world. He devises control systems including sensing, planning, and feedback controllers by accounting for robot dynamics, real-time constraints, and hardware limitations. Donghyun is extending the research field to perception and machine intelligence to make the robotic system more dynamic and versatile. His ultimate goal is to build robots that can rapidly and autonomously explore over all-type terrains like humans and animals.","activities":[],"rating":5,"difficulty":3,"reviews":2,"id":"kim-donghyun","courses":[]},{"name":{"first":"Stefan","last":"Krastanov"},"email":"skrastanov@cics.umass.edu","phone":null,"tags":[],"office":"A211F LGRC","website":"https://lab.krastanov.org","webpage":"https://www.cics.umass.edu/people/krastanov-stefan","interests":"Quantum Information Science, Error Correcting Codes, Hardware Modeling","research":"Stefan works on the design, control, and optimization of quantum hardware for computation and networking, from its analog physical description up to the compilation of error-corrected logical circuitry running on it. His research centers around leaky abstraction boundaries between the many layers of technologies making up the field of quantum computing and quantum information science.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"krastanov-stefan","courses":[]},{"name":{"first":"Scott","last":"Kaplan"},"email":"sfkaplan@cs.umass.edu","phone":"(413) 545-4206","tags":[],"office":"372 CS Building","website":"https://www.cs.amherst.edu/~sfkaplan/","webpage":"https://www.cics.umass.edu/faculty/directory/kaplan_scott","interests":"","research":"Professor Kaplan's primary research focus lies in OS- and run-time-level memory management. His current interests include fair sharing virtual memory systems, prefetching and clustering, heap-size adaptive garbage collectors, and memory management for grid/cluster computing","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"kaplan-scott","courses":[]},{"name":{"first":"Neil","last":"Immerman"},"email":"immerman@cs.umass.edu","phone":"(413) 545-1862","tags":[],"office":null,"website":"http://www.cs.umass.edu/~immerman/","webpage":"https://www.cics.umass.edu/faculty/directory/immerman_neil","interests":"Logic in Computer Science, computer-aided verification, complexity theory, database theory.","research":"Professor Immerman is one of the key developers of an active research program called descriptive complexity. This area applies logic to computational complexity, discerning strong mathematical structure underlying standard complexity measures. In a striking series of results, Professor Immerman has shown how all important complexity measures have natural descriptive characterizations. Using this characterization of complexity classes, Professor Immerman showed the very surprising result that non-deterministic space is closed under complement. The negation of this result was a common, well-believed conjecture that had stood open for twenty-five years. Robert Szelepcsenyi proved this result independently.","activities":[],"rating":4.2,"difficulty":3.5,"reviews":24,"id":"immerman-neil","courses":[]},{"name":{"first":"Deepak","last":"Ganesan"},"email":"dganesan@cs.umass.edu","phone":"(413) 545-2450","tags":[],"office":"A343 LGRC","website":"http://www.cs.umass.edu/~dganesan/","webpage":"https://www.cics.umass.edu/faculty/directory/ganesan_deepak","interests":"Wireless health sensing, ubiquitous computing, wireless communication, embedded systems, energy harvesting, and machine learning for sensor data.","research":"Professor Ganesan's research is at the intersection of low-power sensing and communication, networked systems, and machine learning to enable pervasive sensing at scale for societal applications. His recent work includes the design of ultra-low passive radios for wearables, novel wearable technologies such as low-power eye trackers to monitor health signals, and robust detection of important health targets such as drug use, smoking, and over-eating. He is a thrust lead on the NIH funded MD2K Center for Excellence on Mobile Sensor-to-Knowledge and on the executive committee of the Center for Personal Health Monitoring at UMass Amherst.","activities":[],"rating":3.9,"difficulty":3,"reviews":11,"id":"ganesan-deepak","courses":[]},{"name":{"first":"Sridhar","last":"Mahadevan"},"email":"mahadeva@cics.umass.edu","phone":null,"tags":[],"office":null,"website":"http://www.cs.umass.edu/~mahadeva/","webpage":"https://www.cics.umass.edu/faculty/directory/mahadevan_sridhar","interests":"Artificial intelligence, cognitive science, machine learning, reinforcement learning, robot learning, sequential decision-making.","research":"Professor Mahadevan's research interests span several subfields of artificial intelligence and computer science, including machine learning, multi-agent systems, planning, perception, and robotics. His research in machine learning has been eclectic, ranging from pioneering work in explanation-based learning where his thesis introduced the model of learning apprentices for knowledge acquisition from experts, to the first rigorous study of concept learning with prior determination knowledge using the framework of Probably Approximately Correct (PAC) learning. Over the past decade, his research has centered around a general framework for autonomous learning and sequential decision-making, which studies how agents embedded in real-world environments can acquire knowledge on how to act from a stream of noisy percepts.  The framework is rigorously validated using temporal statistical process models, principally Markov decision processes. His recent research has focused on hierarchical probabilistic models, including hierarchical hidden Markov processes, semi-Markov decision processes, and hierarchical partially observable Markov decision processes. Professor Mahadevan has also developed state-of-the-art applications, including mobile robot navigation in indoor office environments, an active vision system for finding objects in cluttered rooms, and coordination among teams of factory agents optimizing production control.","activities":[],"rating":3.8,"difficulty":3.8,"reviews":10,"id":"mahadevan-sridhar","courses":[]},{"name":{"first":"David","last":"Jensen"},"email":"jensen@cs.umass.edu","phone":"(413) 545-9677","tags":[],"office":"308 CS Building","website":"https://groups.cs.umass.edu/jensen/","webpage":"https://www.cics.umass.edu/faculty/directory/jensen_david","interests":"Machine learning, data science, causal inference, computational social science.","research":"Professor Jensen's research focuses on machine learning and data science for analyzing large social, technological, and computational systems.  His current research focuses on methods for constructing accurate causal models from observational and experimental data, with applications to social science, fraud detection, security, and systems management.  Additional research interests include explainable machine learning, statistical relational learning, research methods in computer science, evaluation of machine learning systems, and data science for public policy and social good.","activities":[],"rating":4.7,"difficulty":3,"reviews":90,"id":"jensen-david","courses":[]},{"name":{"first":"Akshay","last":"Krishnamurthy"},"email":"akshay@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"https://www.cics.umass.edu/~akshay","webpage":"https://www.cics.umass.edu/faculty/directory/krishnamurthy-akshay","interests":"Statistical Machine Learning, Interactive Learning, Reinforcement Learning","research":"Professor Krishnamurthy's research interests are in machine learning and statistics. He is most interested in design and analysis of machine learning algorithms that judiciously acquire data in a feedback-driven manner, a paradigm referred to as interactive learning. His work in this area spans both unsupervised methods for exploratory data analysis and supervised methods for complex prediction problems. His recent focus is on sample-efficient exploration in reinforcement learning.","activities":[],"rating":2.5,"difficulty":3.9,"reviews":11,"id":"krishnamurthy-akshay","courses":[]},{"name":{"first":"Ravi","last":"Karkar"},"email":"rkarkar@umass.edu","phone":null,"tags":[],"office":"A211G LGRC","website":"https://people.cs.umass.edu/~rkarkar/","webpage":"https://www.cics.umass.edu/people/karkar-ravi","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"karkar-ravi","courses":[]},{"name":{"first":"Marc","last":"Liberatore"},"email":"liberato@cs.umass.edu","phone":"(413) 545-3061","tags":[],"office":"318 CS Building","website":"http://www.cs.umass.edu/~liberato/","webpage":"https://www.cics.umass.edu/faculty/directory/liberatore_marc","interests":"Anonymity systems, file and network forensics.","research":"Marc's research currently focuses on improving network forensic tools and techniques.","activities":[],"rating":4.6,"difficulty":3.3,"reviews":40,"id":"liberatore-marc","courses":[]},{"name":{"first":"Parviz","last":"Kermani"},"email":"parviz@cs.umass.edu","phone":null,"tags":[],"office":"A263 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/kermani-parviz","interests":"","research":"","activities":[],"rating":4.2,"difficulty":3.6,"reviews":16,"id":"kermani-parviz","courses":[]},{"name":{"first":"Ben","last":"Marlin"},"email":"marlin@cs.umass.edu","phone":"(413) 545-4493","tags":[],"office":"A355 LGRC","website":"https://groups.cs.umass.edu/marlin/","webpage":"https://www.cics.umass.edu/faculty/directory/marlin_benjamin","interests":"Machine learning, probabilistic models, approximate inference and learning techniques, non-likelihood-based model estimation, missing data, time series.","research":"Professor Marlin's research interests lie at the intersection of artificial intelligence, machine learning and statistics. He is particularly interested in hierarchical graphical models and approximate inference/learning techniques including Markov Chain Monte Carlo and variational Bayesian methods. His current research has a particular emphasis on models and algorithms for multivariate time series data. His current applied work is focusing on machine learning-based analytics for clinical and mobile health (mHealth) data. In the past, he has worked on a broad range of applications including collaborative filtering and ranking, unsupervised structure discovery and feature induction, object recognition and image labeling, and natural language processing, and he continues to consult on projects in these areas.","activities":[],"rating":4.3,"difficulty":4,"reviews":9,"id":"marlin-ben","courses":[]},{"name":{"first":"Mohammad","last":"Hajiesmaili"},"email":"hajiesmaili@cs.umass.edu","phone":null,"tags":[],"office":"A323 LGRC","website":"https://groups.cs.umass.edu/hajiesmaili","webpage":"https://www.cics.umass.edu/people/hajiesmaili-mohammad","interests":"Carbon-intelligent computing, data-driven online optimization","research":"Mohammad's research centers on studying fundamental design problems under uncertainty in a wide range of application domains. More specifically, Mohammad uses theoretical tools from optimization, machine learning, and algorithm, to design rigorous systems that work provably efficient in uncertain settings. The current target application domains are (i) computer networks and data center optimization; and (ii) energy systems, including electric vehicles.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"hajiesmaili-mohammad","courses":[]},{"name":{"first":"Mohit","last":"Iyyer"},"email":"miyyer@cs.umass.edu","phone":null,"tags":[],"office":"258 CS Building","website":"https://people.cs.umass.edu/~miyyer/","webpage":"https://www.cics.umass.edu/people/iyyer-mohit","interests":"","research":"","activities":[],"rating":4.3,"difficulty":3.6,"reviews":7,"id":"iyyer-mohit","courses":[]},{"name":{"first":"Andrew","last":"Lan"},"email":"andrewlan@cs.umass.edu","phone":null,"tags":[],"office":"230 CS Building","website":"https://people.umass.edu/~andrewlan/","webpage":"https://www.cics.umass.edu/people/lan-andrew","interests":"Personalized education, convex optimization, probabilistic models, machine learning, signal processing.","research":"Andrew's research focuses on the development of human-in-the-loop machine learning methods to enable scalable, effective, and fail-safe personalized learning in education, by collecting and analyzing massive and multi-modal learner and content data. This massive and multi-modal learner and content data can be collected in both traditional classrooms and online learning platforms, e.g., during massive open online courses (MOOCs). His vision is to develop a system that delivers high-quality, affordable, and personalized learning experiences to every learner in the world. He is also broadly interested in areas including convex optimization, probabilistic models, machine learning, and signal processing.","activities":[],"rating":3.9,"difficulty":3.5,"reviews":34,"id":"lan-andrew","courses":[]},{"name":{"first":"Jamie","last":"Macbeth"},"email":"jmacbeth@smith.edu","phone":null,"tags":[],"office":null,"website":"http://jamiemacbeth.com/","webpage":"https://www.cics.umass.edu/people/macbeth-jamie","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"macbeth-jamie","courses":[]},{"name":{"first":"Meghan","last":"Huber"},"email":"mehuber@umass.edu","phone":null,"tags":[],"office":null,"website":"https://mie.umass.edu/faculty/meghan-huber","webpage":"https://www.cics.umass.edu/people/huber-meghan","interests":"","research":"Meghan Huber's research lies at the intersection of robotics and human neuromotor control, and focuses on understanding how humans and robots can learn from the physical interactions of one another.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"huber-meghan","courses":[]},{"name":{"first":"Peter","last":"Klemperer"},"email":"pklemperer@cs.umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/people/klemperer-peter","interests":"","research":"","activities":[],"rating":1.8,"difficulty":3.3,"reviews":4,"id":"klemperer-peter","courses":[]},{"name":{"first":"Subhransu","last":"Maji"},"email":"smaji@cs.umass.edu","phone":"(413) 577-2570","tags":[],"office":"274 CS Building","website":"https://cs.umass.edu/~smaji","webpage":"https://www.cics.umass.edu/faculty/directory/maji_subhransu","interests":"Computer Vision and Machine Learning","research":"Professor Maji's research spans computer vision and machine learning. He is interested in building AI systems with rich visual reasoning capabilities enabling a wide range of applications. His research includes developing architectures for visual understanding that are robust, efficient, and have the ability to learn from a few examples. His research is also interdisciplinary where he develops novel computer vision algorithms for problems in Ecology and Astronomy.","activities":[],"rating":3.5,"difficulty":4,"reviews":8,"id":"maji-subhransu","courses":[]},{"name":{"first":"Antony","last":"Hosking"},"email":"antony.hosking@anu.edu.au","phone":null,"tags":[],"office":null,"website":"https://cs.anu.edu.au/people/tony-hosking","webpage":"https://www.cics.umass.edu/people/hosking-antony","interests":"Programming language design and implementation.","research":"Professor Hosking work on problems arising in software security, object persistence, object databases, distribution, memory management (garbage collection), managed language runtimes, language virtual machines, optimizing compilers, object persistence, object databases, distribution, memory management (garbage collection), and architectural support for programming languages and applications.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"hosking-antony","courses":[]},{"name":{"first":"Vangelis","last":"Kalogerakis"},"email":"kalo@cs.umass.edu","phone":"(413) 545-1952","tags":[],"office":"250 CS Building","website":"http://www.cs.umass.edu/~kalo/","webpage":"https://www.cics.umass.edu/faculty/directory/kalogerakis_evangelos","interests":"Computer graphics and vision: geometric modeling, 3D deep learning, animation, shape analysis and synthesis, scene modeling, 3D reconstruction","research":"Evangelos Kalogerakis' research deals with the development of graphics+vision algorithms and techniques, empowered by AI/ML, to help people to easily create and process representations of the 3D visual world. He is particularly interested in algorithms that generate 3D models of objects, scenes, animations, and intelligently process 3D scans, geometric data, collections of shapes, images, and video.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"kalogerakis-vangelis","courses":[]},{"name":{"first":"James","last":"Kurose"},"email":"kurose@cs.umass.edu","phone":"(413) 545-1585","tags":[],"office":"376 CS Building","website":"http://www-net.cs.umass.edu/personnel/kurose.html","webpage":"https://www.cics.umass.edu/faculty/directory/kurose_james","interests":"Computer network protocols and architecture, network measurement, sensor networks, and multimedia communication.","research":"Professor Kurose's research interests are in the areas of computer network protocols and architecture, network measurement, sensor networks, and multimedia communication. He is also interested in the development of asynchronous learning materials and pedagogy, particularly the use of Internet-based multimedia material.","activities":[],"rating":4.9,"difficulty":2.6,"reviews":18,"id":"kurose-james","courses":[]},{"name":{"first":"Narges","last":"Mahyar"},"email":"nmahyar@cs.umass.edu","phone":"(413) 577-0063","tags":[],"office":"A211H LGRC","website":"http://groups.cs.umass.edu/nmahyar/","webpage":"https://www.cics.umass.edu/people/mahyar-narges","interests":"Human-Computer Interaction (HCI), Information Visualization, Digital Civics, Social Computing, Crowdsourcing, and Design Thinking.","research":"Professor Mahyar's research falls at the intersection of social computing and design with the goal of augmenting groups' abilities to solve complex problems. She designs, develops, and evaluates novel social computing and visualization techniques that help people (both experts and non-experts) make better decisions. More recently, she has focused on exploring new strategies for scaling and diversifying public engagement in massive decision-making processes related to civic issues. Her work aims to advance civic technology that alleviates social inequality by including marginalized perspectives and leveraging the diversity of viewpoints and experiences to drive collective innovation. To build these technologies, she works closely with domain experts and affected population groups to understand their activities, current challenges, and ultimate goals.","activities":[],"rating":2.4,"difficulty":3.5,"reviews":8,"id":"mahyar-narges","courses":[]},{"name":{"first":"Nick","last":"Merlino"},"email":"nmerlino@umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/people/merlino-nick","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"merlino-nick","courses":[]},{"name":{"first":"R.","last":"Manmatha"},"email":"manmatha@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://ciir.cs.umass.edu/~manmatha/","webpage":"https://www.cics.umass.edu/faculty/directory/manmatha_r","interests":"Multimedia indexing and retrieval, image and video retrieval, document image analysis, digital libraries, computer vision, information retrieval.","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"manmatha-r.","courses":[]},{"name":{"first":"Hung","last":"Le"},"email":"hungle@cs.umass.edu","phone":null,"tags":[],"office":"332 CS Building","website":"https://hunglvosu.github.io","webpage":"https://www.cics.umass.edu/people/le-hung","interests":"Algorithm design, theoretical computer science, combinatorial optimization, graph algorithms, metric embedding, distributed algorithms.","research":"Professor Le has been focusing on designing algorithms for graph problems. He is particularly interested in understanding the power and limits of structures of graphs in algorithm design. His major contributions include efficient approximation algorithms for the Travelling Salesperson Problem, constructions of optimally sparse and light networks, and providing theoretical guarantees for local search heuristics.","activities":[],"rating":5,"difficulty":5,"reviews":1,"id":"le-hung","courses":[]},{"name":{"first":"Ivan","last":"Lee"},"email":"silee@cs.umass.edu","phone":"(413) 545-3968","tags":[],"office":"A351B LGRC","website":"http://ahhalab.org/","webpage":"https://www.cics.umass.edu/faculty/directory/lee-sunghoon","interests":"Mobile and personalized health, wearable health sensing, embedded systems, sensor data analytics, clinical science.","research":"Professor Lee's research interests are in Mobile & Personalized Health, focusing on the use of digital technologies to understand health conditions and promote health behavioral change in individuals with motor/cognitive impairments, such as stroke, Parkinson's disease, traumatic brain injuries, osteoarthritis, etc. With a primary focus on evolution, his specific research interests include 1) developing novel sensors and remote monitoring solutions that are motivated by practical medical needs, 2) design appropriate human studies, and 3) applying human-centered approaches to quantitatively and qualitatively analyze the efficacy of the developed solutions.","activities":[],"rating":2.9,"difficulty":3.6,"reviews":9,"id":"lee-ivan","courses":[]},{"name":{"first":"Marius","last":"Minea"},"email":"marius@cs.umass.edu","phone":"(413) 545-1734","tags":[],"office":"A261 LGRC","website":"https://people.cs.umass.edu/~marius/","webpage":"https://www.cics.umass.edu/people/minea-marius","interests":"Formal methods with focus on model checking, program analysis, modeling and verification of security protocols, symbolic execution and testing.","research":"Marius' research lies at the intersection of formal verification, security, and software engineering. He applies techniques grounded in formal methods to analyze the correctness and security of software systems, including protocols, web applications and services. He has worked on formally modeling security properties and attacks, extracting abstract verifiable models from programs, and is particularly interested in detecting program errors and vulnerabilities.","activities":[],"rating":3,"difficulty":4.6,"reviews":174,"id":"minea-marius","courses":[]},{"name":{"first":"Brian","last":"Levine"},"email":"bnl@umass.edu","phone":null,"tags":[],"office":"306 CS Building","website":"http://www.cs.umass.edu/~brian","webpage":"https://www.cics.umass.edu/faculty/directory/levine_brian","interests":"Child rescue and digital forensics, networking, network security, and cryptoeconomics","research":"Professor Levine's research and teaching focus on security in the context of the Internet and mobile systems, including topics in child rescue, privacy, blockchains, cellular networks, and peer-to-peer networking. Prof. Levine's work on thwarting child exploitation is funded in part by the Department of Justice and often in collaboration with Internet Crimes Against Children (ICAC) Task Forces. His research group's joint projects with the FBI and ICAC have had international impact, resulting in the rescue of hundreds of children from sexually abusive situations by investigators using his lab's tools.","activities":[],"rating":4.4,"difficulty":3,"reviews":20,"id":"levine-brian","courses":[]},{"name":{"first":"Ghazaleh","last":"Parvini"},"email":"gparvini@cs.umass.edu","phone":null,"tags":[],"office":"A231 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/parvini-ghazaleh","interests":"Algorithms, Combinatorial Algorithms, Graph Theory, Computational Biology, Discrete Mathematics","research":"Ghazaleh's current research focuses on Phylogenetic Decisiveness. Phylogenetic Decisiveness is in close relation with the No-rainbow Coloring Problem in Graph Theory which is known to be NP-Complete. Her main interest is trying to give some exact or randomized algorithms and finding new bounds to make the naive algorithm faster and more efficient.","activities":[],"rating":3.3,"difficulty":4.1,"reviews":20,"id":"parvini-ghazaleh","courses":[]},{"name":{"first":"Jenna","last":"Marquard"},"email":"marquard@engin.umass.edu","phone":"(413) 545-0646","tags":[],"office":null,"website":"http://mie.umass.edu/faculty/jenna-marquard","webpage":"https://www.cics.umass.edu/faculty/directory/marquard_jenna","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"marquard-jenna","courses":[]},{"name":{"first":"Edwina L.","last":"Rissland"},"email":"rissland@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://www.cs.umass.edu/~rissland/","webpage":"https://www.cics.umass.edu/people/rissland_edwina","interests":"Case-based reasoning, AI and Law, concept formation and evolution, CBR and IR, cyberlaw.","research":"Professor Rissland's current areas of research include include case-based reasoning (CBR), AI and legal reasoning, CBR and information retrieval, mixed paradigm reasoning, and cyberlaw.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"rissland-edwina l.","courses":[]},{"name":{"first":"Arya","last":"Mazumdar"},"email":"arya@cs.umass.edu","phone":"(413) 545-0359","tags":[],"office":null,"website":"http://www.cs.umass.edu/~arya","webpage":"https://www.cics.umass.edu/people/mazumdar-arya","interests":"Error Correcting Codes, Information Theory, Statistical Reconstruction, Distributed Optimization","research":"Arya's research in error-correcting codes has produced the first efficiently implementable family of codes over permutations, as well as the best known fundamental limits of locally repairable codes for distributed storage. Arya's current research interests include recent advances of statistical machine learning in the application domains of interactive learning algorithms, statistical reconstructions, community detection and distributed optimization. Arya is also very much interested in fundamental problems that involve trade-offs between communication and computation in distributed settings.","activities":[],"rating":3.2,"difficulty":3.8,"reviews":21,"id":"mazumdar-arya","courses":[]},{"name":{"first":"Justin","last":"Obara"},"email":"jobara@cs.umass.edu","phone":null,"tags":[],"office":"A265 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/obara-justin","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"obara-justin","courses":[]},{"name":{"first":"Ali","last":"Sarvghad Batn Moghaddam"},"email":"asarv@cs.umass.edu","phone":null,"tags":[],"office":"A211J LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/sarvghad-batn-moghaddam-ali","interests":"Information Visualization, Visual Analytics, Human-Computer Interaction, Interaction Design, and Computer Supported Collaborative Work.","research":"Dr. Sarvghad's research investigates novel visualization and interaction techniques for supporting exploratory data analysis and sense-making. He is also interested in the application of advanced visualization and data analysis techniques to solve real-world problems in various fields such as healthcare and business.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"sarvghad batn moghaddam-ali","courses":[]},{"name":{"first":"Andrew","last":"McCallum"},"email":"mccallum@cs.umass.edu","phone":"(413) 545-1323","tags":[],"office":"244 CS Building","website":"http://www.cs.umass.edu/~mccallum/","webpage":"https://www.cics.umass.edu/faculty/directory/mccallum_andrew","interests":"Information extraction, knowledge discovery from text, statistical natural language processing, machine learning, graphical models.","research":"The main goal of McCallum's research is to dramatically increase our ability to mine actionable knowledge from unstructured text. He is especially interested in information extraction from the Web, understanding the connections among people and between organizations, expert finding, social network analysis, and mining the scientific literature. Toward this end he and his group develop and employ various methods in statistical machine learning, natural language processing, information retrieval and data mining---tending toward probabilistic approaches and graphical models. He is one of the pioneers in the development of conditional random fields. As a demonstration of his research, his group has created the research paper search engine at http://www.rexa.info.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"mccallum-andrew","courses":[]},{"name":{"first":"Siobhan","last":"Mei"},"email":"siobhanander@umass.edu","phone":null,"tags":[],"office":"338 CS Building","website":null,"webpage":"https://www.cics.umass.edu/people/mei-siobhan","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"mei-siobhan","courses":[]},{"name":{"first":"Cameron","last":"Musco"},"email":"cmusco@cs.umass.edu","phone":null,"tags":[],"office":"234 CS Building","website":"https://people.cs.umass.edu/~cmusco/","webpage":"https://www.cics.umass.edu/people/musco-cameron","interests":"Algorithm design, theoretical computer science, numerical linear algebra, machine learning & data science, biological distributed algorithms.","research":"Professor Musco studies algorithm design, working at the intersection of theoretical computer science, numerical linear algebra, data science, and machine learning.  He is particularly interested in the power of randomized approximation algorithms and in streaming, distributed, and low-memory computation. His most significant contributions have been in developing fast randomized methods for fundamental linear algebraic problems, often with applications to data science and machine learning.","activities":[],"rating":4.9,"difficulty":4.5,"reviews":13,"id":"musco-cameron","courses":[]},{"name":{"first":"Filip","last":"Rozpedek"},"email":null,"phone":null,"tags":[],"office":"A211E LGRC","website":"https://sites.google.com/view/filiprozpedek","webpage":"https://www.cics.umass.edu/people/rozpedek-filip","interests":"Quantum information theory, quantum optics, quantum communication, quantum networks, quantum repeaters, quantum cryptography, quantum error correction, entanglement distribution and routing, entanglement distillation, quantum key distribution","research":"Filip's research focuses on designing novel quantum communication, quantum repeater and quantum network architectures. In his research he combines various techniques from quantum information theory, mathematical optimisation, quantum optics as well as physics of quantum devices in order to bring closer the realisation of practical quantum networks. One such strategy that has been a focus of Filip's recent research is the use of bosonic quantum error correcting codes for quantum repeaters. Filip has been also actively involved in modelling proof-of-principle quantum repeater experiments and optimizing entanglement distillation schemes.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"rozpedek-filip","courses":[]},{"name":{"first":"Brendan","last":"O'Connor"},"email":"brenocon@cs.umass.edu","phone":"(413) 577-2503","tags":[],"office":"238 CS Building","website":"https://cs.umass.edu/~brenocon","webpage":"https://www.cics.umass.edu/faculty/directory/oconnor_brendan","interests":"Natural language processing, computational social science, statistical machine learning, social media.","research":"Brendan O'Connor is an associate professor in the College of Information and Computer Sciences at the University of Massachusetts Amherst, who works in the intersection of computational social science and natural language processing - studying how social factors influence language technologies, and how to better understand social trends with text analysis. For example, he has investigated racial bias in NLP technologies, political events reported in news, language in Twitter, and crowdsourcing foundations of NLP. He is a recipient of the NSF CAREER and Google Faculty Research awards, has received a best paper award, and his research has been cited thousands of times and been featured in the media. At UMass Amherst, he is affiliated with the Computational Social Science Institute and Center for Data Science. His PhD was completed in 2014 from Carnegie Mellon University's Machine Learning Department, and he has previously been a Visiting Fellow at the Harvard Institute for Quantitative Social Science, and worked in the Facebook Data Science group and at the company Crowdflower; he started studying the intersection of AI and social science in Symbolic Systems (BS/MS) at Stanford University.","activities":[],"rating":1.7,"difficulty":3.3,"reviews":15,"id":"o'connor-brendan","courses":[]},{"name":{"first":"Adam","last":"O'Neill"},"email":"adamo@cs.umass.edu","phone":null,"tags":[],"office":"A329 LGRC","website":"https://groups.cs.umass.edu/oneill/","webpage":"https://www.cics.umass.edu/people/oneill-adam","interests":"Practice-oriented theory of cryptography, cryptography in novel computing environments.","research":"Professor O'Neill's research runs along two main threads.  First, he studies the practice-oriented theory of outsourced database protocols, which allow a client to store its database on an untrusted server while simultaneously hiding as much information about the data as possible for the server and allowing the client to make queries.  This is novel as for efficiency some information about the data has to be revealed to the server.  Second, he studies the design and analysis of deployable or deployed protocols in the ``random oracle model,'' which models a cryptographic hash function as a truly random function.","activities":[],"rating":3.3,"difficulty":4.5,"reviews":6,"id":"o'neill-adam","courses":[]},{"name":{"first":"Negin","last":"Rahimi"},"email":"rahimi@cs.umass.edu","phone":"(413) 545-4852","tags":[],"office":"360 CS Building","website":"https://people.cs.umass.edu/~rahimi/","webpage":"https://www.cics.umass.edu/people/rahimi-negin","interests":"","research":"","activities":[],"rating":0,"difficulty":0,"reviews":0,"id":"rahimi-negin","courses":[]},{"name":{"first":"Krithivasan","last":"Ramamritham"},"email":"krithi@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"https://sites.google.com/site/ramamrithamkrithi/home/","webpage":"https://www.cics.umass.edu/faculty/directory/ramamritham_krithivasan","interests":"Real-time systems, transaction processing in real-time databases, data management on the Web.","research":"In the area of hard real-time systems, Professor Ramamritham's interests are in the architectural and operating system support for hard real-time systems, scheduling mechanisms for multi-tasking environments under dynamic conditions, and the composable design of adaptable software systems that integrate hard real-time with fault-tolerance, including issues relating to the design-time and run-time assurance of their correctness, timeliness, predicatibility and reliability properties.  In the database area, Professor Ramamritham is interested in supporting novel, advanced applications that expand the limits of traditional databases, especially transaction systems. Here, Professor Ramamritham's work aims to enhance the performance and functionality of applications (such as workflows and information retrieval) that require or can benefit from transactional support, by exploiting semantic information about the objects, operations, transaction model, and the application. In the area of real-time databases, Professor Ramamritham's work  focuses on integrating active, real-time, temporal and multimedia databases for time-constrained applications. Priority assignment and real-time transaction scheduling in active real-time databases, real-time logging and recovery, temporal consistency and scheduling in temporal databases, and multimedia databases are some of the current topics under investigation.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"ramamritham-krithivasan","courses":[]},{"name":{"first":"Alexandra","last":"Meliou"},"email":"ameli@cs.umass.edu","phone":"(413) 545-3788","tags":[],"office":"330 CS Building","website":"http://people.cs.umass.edu/~ameli","webpage":"https://www.cics.umass.edu/faculty/directory/alexandra_meliou","interests":"Data management, data quality, provenance, causality, explanations, data accessibility, and algorithmic bias.","research":"Professor Meliou's research interests are in the area of data and information management, with an emphasis on the challenges of dealing with imperfect data, such as data with errors, skews, and biases. Her work offers crucial insights into data quality issues, through frameworks that diagnose the causes of errors and identify repairs in the processes that produce the data. Her research promotes users' trust in both data and systems through support for understanding and explanations. An overarching goal of her work is to augment data management with user-facing functionality that helps people make sense of their data and use it effectively.","activities":[],"rating":4,"difficulty":3,"reviews":3,"id":"meliou-alexandra","courses":[]},{"name":{"first":"Scott","last":"Niekum"},"email":"sniekum@cs.umass.edu","phone":"(413) 545-1862","tags":[],"office":"374 CS Building","website":null,"webpage":"https://www.cics.umass.edu/people/niekum-scott","interests":"Imitation learning, reinforcement learning, AI safety, robotic manipulation, and human-robot interaction.","research":"The goal of Professor Niekum's research is to enable personal robots to be deployed in the home and workplace with minimal intervention by robotics experts. In settings such as these, robots do not operate in isolation, but have continual interactions with people and objects in the world. With this in mind, his research focuses on developing algorithms to solve problems that robot learners encounter in real-world interactive settings. Thus, this work draws roughly equally from both machine learning and robotics, including topics such as imitation learning, reinforcement learning, safety, manipulation, and human-robot interaction.  Specifically, he is interested in addressing the following questions: How can human demonstrations and interactions be used to bootstrap the learning process? How can robots autonomously improve their understanding of the world through embodied interaction? And how can robots learn from heterogenous, noisy interactions and still provide strong probabilistic guarantees of correctness and safety?","activities":[],"rating":1.8,"difficulty":4.4,"reviews":4,"id":"niekum-scott","courses":[]},{"name":{"first":"Matthew","last":"Rattigan"},"email":"rattigan@cs.umass.edu","phone":"(413) 545-1395","tags":[],"office":"A135 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/rattigan-matthew","interests":"Computing for the common good, causal learning, equity and inclusion, entrepreneurship.","research":"Matt is focused on applying Data Science and Machine Learning techniques toward applications that benefit the public interest.  He seeks to identify partnerships between academia and organizations in the public, private, and non-profit sectors who are interested in using data to advance social good initiatives.","activities":[],"rating":4.5,"difficulty":3.3,"reviews":30,"id":"rattigan-matthew","courses":[]},{"name":{"first":"Andrew","last":"McGregor"},"email":"mcgregor@cs.umass.edu","phone":null,"tags":[],"office":"334 CS Building","website":"http://www.cs.umass.edu/~mcgregor/","webpage":"https://www.cics.umass.edu/faculty/directory/mcgregor_andrew","interests":"Theoretical computer science.","research":"Professor McGregor's research includes algorithms for processing massive data sets and data streams; computing with noisy or incomplete data; clustering; coding and information theory. His work appears in theoretical computer science, database, data mining, coding theory, and machine learning publications.","activities":[],"rating":4.7,"difficulty":3.4,"reviews":11,"id":"mcgregor-andrew","courses":[]},{"name":{"first":"Arnold L.","last":"Rosenberg"},"email":"rsnbrg@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://www.cs.umass.edu/~rsnbrg/","webpage":"https://www.cics.umass.edu/people/rosenberg_arnold","interests":"Theoretical and algorithmic aspects of modern computing environments, such as clusters and grids.","research":"Professor Rosenberg's research focuses on developing algorithmic models and techniques to deal with the new modalities of \"collaborative computing\" that result from emerging technologies such as cluster computing, web computing, and grid computing. He is the (co)author of more than 150 technical papers on these and other topics in theoretical computer science and discrete mathematics, and he is the coauthor of a 2001 book: Graph Separators, with Applications.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"rosenberg-arnold l.","courses":[]},{"name":{"first":"Tauhidur","last":"Rahman"},"email":"trahman@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"https://www.tauhidurrahman.com/","webpage":"https://www.cics.umass.edu/people/rahman-tauhidur","interests":"Mobile and ubiquitous computing, human health and behavior modeling with statistical signal processing and machine learning, novel on-body and off-body sensor development with embedded systems and applied physics.","research":"Prof. Rahman aims to develop next-generation mobile health technologies that leverages naturally generated and backscattered acoustic and electromagnetic waves from the human body (e.g., heart, skin, lung) and its surrounding environment (e.g, air, food) to unobtrusively, continuously and passively extract information about high-level health and behavioral variables including eating behavior, sleep, alcohol addiction, spread of infectious diseases and food quality.\nHis research involves (1) low-level sensor development to capture observable low-level physical signals from our bodies and surrounding environments with high fidelity, (2) signal interpretation algorithm development to map these low-level physical signals to relevant biological and behavioral measurements, and (3) mobile computing to run these algorithms in low power and resource settings. His research is interdisciplinary and employs core concepts and theories from different domains including applied physics, embedded and mobile computing, signal processing, machine learning, health sciences and medicine. Professor Rahman's long-term research vision is to rethink the core physical mechanisms of existing health technologies and to impact the way we diagnose diseases, track and manage our health.","activities":[],"rating":5,"difficulty":3.3,"reviews":4,"id":"rahman-tauhidur","courses":[]},{"name":{"first":"Leon","last":"Osterweil"},"email":"ljo@cs.umass.edu","phone":"(413) 545-2186","tags":[],"office":"316A CS Building","website":"http://laser.cs.umass.edu/people/ljo.html","webpage":"https://www.cics.umass.edu/faculty/directory/osterweil_leon","interests":"Process modeling and process programs, analysis of concurrency, software architectures, ecommerce and egovernment, medical processes and medical safety.","research":"Professor Osterweil  is developing process programming technology in the context of a distributed process-centered environment. A process centered environment interprets process programs, using them to coordinate the efforts of people, computers, and software tools. It also provides a platform for the evaluation, comparison, analysis, evolution and improvement of software development processes and their support. Programming software development processes will lead to better understanding and improvement of sotware production, as well as providing more effective computerized  support for such processes.","activities":[],"rating":3.3,"difficulty":2,"reviews":2,"id":"osterweil-leon","courses":[]},{"name":{"first":"Neeraj","last":"Suri"},"email":"suri@cics.umass.edu","phone":null,"tags":[],"office":null,"website":"https://ssg.lancs.ac.uk/people/suri/","webpage":"https://www.cics.umass.edu/people/suri-neeraj","interests":"","research":"Trustworthy (Dependable & Secure) Systems and Software","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"suri-neeraj","courses":[]},{"name":{"first":"J. Eliot","last":"Moss"},"email":"moss@cs.umass.edu","phone":"(413) 545-4206","tags":[],"office":null,"website":"http://www.cs.umass.edu/~moss/","webpage":"https://www.cics.umass.edu/faculty/directory/moss_j-eliot","interests":"Object-oriented languages (emphasis on implementation), performance measurement and optimization, garbage collection, transactional memory.","research":"Professor Moss's current research interests focus on transactions, garbage collection algorithms, language virtual machines, and chaos in computer performance.","activities":[],"rating":1.9,"difficulty":3.5,"reviews":20,"id":"moss-j. eliot","courses":[]},{"name":{"first":"Robbie","last":"Moll"},"email":"moll@cs.umass.edu","phone":"(413) 545-4315","tags":[],"office":"A217B LGRC","website":null,"webpage":"https://www.cics.umass.edu/faculty/directory/moll_robert","interests":"Knowledge-based systems, combinatorial optimization.","research":"Professor Moll's primary research area is in interactive web-based education. He is currently principal investigator on a grant from the U.S. Department of Education entitled \"Building a Java Instructor Community: An Online Plan for Improving Introductory Computer Science Teaching and Learning\". Professor Moll also has a continuing interest in AI methods applied to combinatorial optimization.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"moll-robbie","courses":[]},{"name":{"first":"Dan","last":"Sheldon"},"email":"sheldon@cs.umass.edu","phone":"(413) 545-4843","tags":[],"office":"246 CS Building","website":"http://cs.umass.edu/~sheldon","webpage":"https://www.cics.umass.edu/faculty/directory/sheldon_dan","interests":"Computational ecology and environmental science; machine learning; probabilistic modeling and inference; network models; optimization.","research":"The primary goal of Professor Sheldon's research is to develop algorithms to understand and make decisions about the environment using large data sets. He seeks to answer foundational questions (what are the general models and principles that underlie big data problems in ecology?) and also to build applications that transform large-scale data resources into scientific knowledge and policy. Some examples of his work include: spatial optimization to conserve endangered species, continent-scale modeling of bird migration, and biological interpretation of weather radar data across the US. Methodologically, Professor Sheldon's primary interests are machine learning, probabilistic inference, and network modeling. His work has contributed broadly applicable new approaches for reasoning about aggregate data in probabilistic graphical models, and for optimization of diffusion processes in networks.","activities":[],"rating":5,"difficulty":3.5,"reviews":25,"id":"sheldon-dan","courses":[]},{"name":{"first":"Ileana","last":"Streinu"},"email":"streinu@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://cs.smith.edu/fac_istreinu.php","webpage":"https://www.cics.umass.edu/faculty/directory/streinu_ileana","interests":"Combinatorial and Computational Geometry.","research":"Professor Streinu's research interests include:","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"streinu-ileana","courses":[]},{"name":{"first":"Prashant","last":"Shenoy"},"email":"shenoy@cs.umass.edu","phone":"(413) 577-0850","tags":[],"office":"A333 LGRC","website":"http://www.cs.umass.edu/~shenoy/","webpage":"https://www.cics.umass.edu/faculty/directory/shenoy_prashant","interests":"Distributed systems, networking, and sustainability.","research":"Professor Shenoy's research focuses on systems issues for distributed systems ranging from large server clusters to networks of small sensors. Current research projects in his lab include (i) cloud and edge computing, (ii) mobile computing and Internet of Things, and (iii) energy and sustainability.","activities":[],"rating":4.6,"difficulty":3.8,"reviews":7,"id":"shenoy-prashant","courses":[]},{"name":{"first":"Heather","last":"Pon-Barry"},"email":"ponbarry@mtholyoke.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/content/pon-barry-heather","interests":"Spoken language processing, human-robot interaction, computer science education.","research":"Professor Pon-Barry develops computational methods that analyze the acoustics and intonation of spoken language to augment traditional speech recognition---to move beyond just the words a person says and incorporate other signals. She uses these methods to create intelligent, adaptive speech interfaces in the context of human-robot interaction, human-computer interaction, and human-human interaction. Pon-Barry has worked on a wide range of projects including spoken dialogue systems, intelligent tutoring systems, recognition of uncertainty in speech, and analysis of acoustic-prosodic entrainment.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"pon-barry-heather","courses":[]},{"name":{"first":"Tim","last":"Richards"},"email":"richards@cs.umass.edu","phone":"(413) 545-4704","tags":[],"office":"A351A LGRC","website":"https://www.cs.umass.edu/~richards","webpage":"https://www.cics.umass.edu/faculty/directory/richards_tim","interests":"","research":"","activities":[],"rating":4.8,"difficulty":3.3,"reviews":66,"id":"richards-tim","courses":[]},{"name":{"first":"Marco","last":"Serafini"},"email":"marco@cs.umass.edu","phone":"(413) 577-0354","tags":[],"office":"A335 LGRC","website":"https://marcoserafini.github.io","webpage":"https://www.cics.umass.edu/people/serafini-marco","interests":"","research":"","activities":[],"rating":2.6,"difficulty":3.3,"reviews":21,"id":"serafini-marco","courses":[]},{"name":{"first":"Ramesh","last":"Sitaraman"},"email":"ramesh@cs.umass.edu","phone":"(413) 545-3279","tags":[],"office":"310 CS Building","website":"https://groups.cs.umass.edu/ramesh","webpage":"https://www.cics.umass.edu/faculty/directory/sitaraman_ramesh","interests":"Internet-scale distributed systems, Content delivery networks, Cloud computing, Algorithms, and Theoretical Computer Science.","research":"Prof. Sitaraman's research focuses on all aspects of Internet-scale distributed systems, including algorithms, architectures, performance, energy efficiency, and user behavior. During a stint in industry, he helped create the world's first major content delivery network (CDN). He is best known for pioneering large distributed systems that currently deliver much of the world's web, videos, applications, and online services to billions of users around the world.","activities":[],"rating":4.6,"difficulty":3.4,"reviews":29,"id":"sitaraman-ramesh","courses":[]},{"name":{"first":"Gayane","last":"Vardoyan"},"email":"gvardoyan@cics.umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/people/vardoyan-gayane","interests":"","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"vardoyan-gayane","courses":[]},{"name":{"first":"Hava","last":"Siegelmann"},"email":"hava@cs.umass.edu","phone":"(413) 577-4282","tags":[],"office":"276 CS Building","website":"https://groups.cs.umass.edu/binds/","webpage":"https://www.cics.umass.edu/faculty/directory/siegelmann_hava","interests":"Advanced Lifelong learning AI, Enhanced Time-aware AI, Innovations in Biological Computation, Super-Turing computation, Computational Neuroscience and Learning, Complex Dynamical systems, Human-robot interface, Health applications, Government and Industrial applications.","research":"Senior faculty for bio-inspired AI, Dr. Siegelmann is an internationally known UMass Provost Professor in Computer Science and a recognized expert in neural networks. She is a core member of the University of Massachusetts Neuroscience and Behavior Program and director of the Biologically Inspired Neural and Dynamical Systems (BINDS) Laboratory. She has been particularly acclaimed for her groundbreaking work in computation beyond the Turing limit, and for achieving advanced learning capabilities through a new type of Artificial Intelligence: Lifelong Learning. Siegelmann conducts highly interdisciplinary research in next-generation machine learning, neural networks, intelligent machine-human collaboration, and computational studies of the brain - with application to AI, data science, and high-tech industry. Prof. Siegelmann is a co-inventor of the Support Vector Clustering (SVC) algorithm, which is widely used across industry and government. Among her recent Nature publications is Biological Underpinning of Lifelong Learning AI, a bio-inspired replay algorithm for advanced lifelong learning, dual fractal structure & function of the human brain, and identification of a previously unknown brain connectome mechanism, which enables cognitive abstraction.","activities":[],"rating":3,"difficulty":3.4,"reviews":15,"id":"siegelmann-hava","courses":[]},{"name":{"first":"Cheryl","last":"Swanier"},"email":"cswanier@cs.umass.edu","phone":"(413) 545-1220","tags":[],"office":"A233 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/swanier-cheryl","interests":"Human Computer Interaction (HCI) and Computer Science Education research; Broadening Participation in Computing. Computer Science Education policy; college deans' attitudes towards teaching and learning.","research":"After a long career in computing, both industry and academia, Professor Swanier's current research interests are in computer science education, human computer interaction with an emphasis in visual programming of educational simulations with end user programming and educational gaming technologies, broadening participation in computing, equity, diversity and inclusion; and pedagogy for computer science teaching and learning.","activities":[],"rating":1.4,"difficulty":2.3,"reviews":20,"id":"swanier-cheryl","courses":[]},{"name":{"first":"Robert","last":"Sproull"},"email":"rfsproull@cs.umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/faculty/directory/sproull_bob","interests":"Computer systems, especially operating systems, networking, and computer graphics. Also asynchronous circuit design.","research":"I have no active research program, but have broad interests in computer science. My research career has ventured into computer graphics, networking, computer printing, asynchronous (hardware) systems, and operating systems. Perhaps a summary phrase might be design and engineering of systems. I am eager to kibitz on graduate student projects consistent with my interests and abilities. I'm working on a few home automation projects, but it's not clear whether research problems lie therein.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"sproull-robert","courses":[]},{"name":{"first":"Cindy Ya","last":"Xiong"},"email":"yaxiong@umass.edu","phone":null,"tags":[],"office":"A217E LGRC","website":"https://cyxiong.com/","webpage":"https://www.cics.umass.edu/people/xiong-cindy-ya","interests":"Data Visualization, Human-Computer Interaction, Visual Perception and Cognition, Decision Making","research":"We increasingly rely on visualizations to answer questions and make decisions about data. By tapping the power of our visual processing system, visualized data - maps, infographics, flow charts, word clouds, and network diagrams - can massively enhance our ability to analyze and understand patterns in order to make data-driven decisions. However, relying on visualized data may also subject us to powerful biases that can significantly influence what we see and decide.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"xiong-cindy ya","courses":[]},{"name":{"first":"Hong","last":"Yu"},"email":"hongyu@cs.umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/faculty/directory/hong_yu","interests":"Information retrieval, extraction, natural language processing, summarization, human-computer interaction, with a focus on biomedical applications.","research":"Professor Yu's research interests are in the areas of information retrieval, extraction, natural language processing, summarization, human-computer interaction, with a focus on biomedical applications. She has led the development of many systems, including the biomedical question answering system AskHERMES (http://www.askhermes.org), the adverse drug event pharmacovigilance system (http://www.ADErepository.org), the innovative biomedical figure search system (http://figuresearch.askhermes.org), and the NoteAid systems that help patients comprehend electronic medical records (http://ClinicalNotesAid.org).","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"yu-hong","courses":[]},{"name":{"first":"Lee","last":"Spector"},"email":"lspector@amherst.edu","phone":null,"tags":[],"office":null,"website":"https://www.amherst.edu/people/facstaff/lspector","webpage":"https://www.cics.umass.edu/faculty/directory/spector_lee","interests":"Artificial intelligence, evolutionary computation, software synthesis, cognitive science, and quantum computing.","research":"Professor Spector teaches and conducts research in artificial intelligence, artificial life, and a variety of areas at the intersections of computer science with cognitive science, physics, evolutionary biology, and the arts. Recent projects have included the development of new computational problem-solving methods based on Darwinian evolution, applications of these methods to problems in software synthesis, mathematics, quantum computing, and the development of simulations to test theories in evolutionary biology.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"spector-lee","courses":[]},{"name":{"first":"Mark","last":"Wilson"},"email":"markwilson@umass.edu","phone":null,"tags":[],"office":null,"website":"http://markcwilson.site/","webpage":"https://www.cics.umass.edu/people/wilson-mark","interests":"Computational discrete mathematics; combinatorial algorithms; computational social science (social choice, voting, electoral system design, resource allocation, game theory, diffusion and learning in networks)","research":"Mark's research is focused on three main areas: networks and data science, collective decisions and actions, and asymptotic and enumerative combinatorics.  His research methodology often involves deriving new algorithms for computational problems, or evaluating performance of algorithms via probabilistic analysis and numerical simulations.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"wilson-mark","courses":[]},{"name":{"first":"Jay","last":"Taneja"},"email":"jtaneja@umass.edu","phone":null,"tags":[],"office":null,"website":"http://www.jaytaneja.com","webpage":"https://www.cics.umass.edu/people/taneja-jay","interests":"Design of mobile and networked systems; technology for development; data science.","research":"Professor Taneja studies the application of computing tools to measuring and managing infrastructure in the developed and developing world, including energy and building systems, but also transportation, water, and sanitation systems.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"taneja-jay","courses":[]},{"name":{"first":"Norman K.","last":"Sondheimer"},"email":"normans@cs.umass.edu","phone":null,"tags":[],"office":null,"website":null,"webpage":"https://www.cics.umass.edu/faculty/directory/sondheimer_norman","interests":"New approaches to the interdisciplinary challenges and fundamental issues that underlie digital government, electronic commerce and education. Active in areas such as K-12 Computer Science Education, Equipment Health Management, Electronic Health Records and Online Dispute Resolution.","research":"Dr. Sondheimer has championed efforts in a variety of areas of Computer Science for many years. He has supervised the fielding of diagnostic tools for medical imaging, locomotive, jet engine and building systems equipment. He helped lead the effort to create remote monitoring centers. With the Auton Lab at the Carnegie Mellon University, he responded to challenges by the US Air Force and US Navy to prove data routinely collected by them can provide substantially early warning of systematic equipment failures.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"sondheimer-norman k.","courses":[]},{"name":{"first":"Donald","last":"Towsley"},"email":"towsley@cs.umass.edu","phone":"(413) 545-0207","tags":[],"office":"A327 LGRC","website":"http://www-net.cs.umass.edu/personnel/towsley.html","webpage":"https://www.cics.umass.edu/faculty/directory/towsley_donald","interests":"Quantum networking and distributed computing, distributed learning and inference","research":"Professor Towsley's research spans a wide range of activities from quantum and classical networking and secure communications to distributed learning and inference. He pioneered the area of network tomography and the use of fluid models for the analysis and control of large networks. More recently he pioneered the theoretical study of covert communications and is one of the leading researchers in the area of quantum networking. He is one of the highly cited computer scientists with over 250 articles in leading journals.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"towsley-donald","courses":[]},{"name":{"first":"Jie","last":"Xiong"},"email":"passionxj@gmail.com","phone":null,"tags":[],"office":"A341 LGRC","website":"https://people.cs.umass.edu/~jxiong/","webpage":"https://www.cics.umass.edu/people/xiong-jie","interests":"","research":"","activities":[],"rating":4.1,"difficulty":2.6,"reviews":14,"id":"xiong-jie","courses":[]},{"name":{"first":"Beverly","last":"Woolf"},"email":"bev@cs.umass.edu","phone":"(413) 545-4265","tags":[],"office":"A257 LGRC","website":"https://centerforknowledgecommunication.org/","webpage":"https://www.cics.umass.edu/faculty/directory/woolf_beverly","interests":"","research":"Beverly Woolf has more than 20 years experience in educational computer science research, production of intelligent tutoring systems and development of multimedia systems. She is author of the 2009 book Building Intelligent Interactive Tutors and is the (co)author of over 150 technical papers. She has delivered tutorial, training programs and keynote addresses and served on panels in more than twenty countries.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"woolf-beverly","courses":[]},{"name":{"first":"Charles","last":"Weems"},"email":"weems@cs.umass.edu","phone":"(413) 545-3163","tags":[],"office":"342 CS Building","website":"http://www.cs.umass.edu/~weems/index.html","webpage":"https://www.cics.umass.edu/faculty/directory/weems_charles","interests":"Computer architecture, interface between architecture and compilers and run-time systems, microarchitecture, memory systems, parallel architectures and applications, GPU computing.","research":"Professor Weems's research interests include computer architecture, memory system architecture, branch prediction, parallel and associative architectures, heterogeneous parallel architectures, media processors, general purpose GPU computing, parallel applications, and integration of compile-time and run-time information in high-performance systems.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"weems-charles","courses":[]},{"name":{"first":"Ethan","last":"Zuckerman"},"email":"ethanz@cs.umass.edu","phone":null,"tags":[],"office":"A141 LGRC","website":null,"webpage":"https://www.cics.umass.edu/people/zuckerman-ethan","interests":"Civic media, online community governance, digital public infrastructure, quantitative studies of media attention, technology and social change.","research":"","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"zuckerman-ethan","courses":[]},{"name":{"first":"Neena","last":"Thota"},"email":"nthota@cs.umass.edu","phone":"(413) 545-4595","tags":[],"office":"A353B LGRC","website":"http://blogs.umass.edu/nthota","webpage":"https://www.cics.umass.edu/faculty/directory/thota-neena","interests":"","research":"","activities":[],"rating":2,"difficulty":3.9,"reviews":44,"id":"thota-neena","courses":[]},{"name":{"first":"Jack","last":"Wileden"},"email":"jack@cs.umass.edu","phone":"(413) 545-0289","tags":[],"office":"242 CS Building","website":"http://www.cs.umass.edu/~jack/","webpage":"https://www.cics.umass.edu/faculty/directory/wileden_jack","interests":"Programming languages, interoperability, databases, bioinformatics.","research":"","activities":[],"rating":3.1,"difficulty":2.9,"reviews":29,"id":"wileden-jack","courses":[]},{"name":{"first":"Hamed","last":"Zamani"},"email":"zamani@cs.umass.edu","phone":"(413) 545-0129","tags":[],"office":"350 CS Building","website":"https://groups.cs.umass.edu/zamani/","webpage":"https://www.cics.umass.edu/people/zamani-hamed","interests":"Information retrieval, recommender systems, and machine learning.","research":"Professor Zamani's research focuses on designing and evaluating statistical and machine learning models with applications to (interactive) information access systems, including search engines, recommender systems, and question answering. Towards these goals he has developed efficientand effective deep learning models for various foundational information retrieval tasks, e.g., document ranking, in addition to some emerging applications, e.g., conversational search.","activities":[],"rating":5,"difficulty":2,"reviews":1,"id":"zamani-hamed","courses":[]},{"name":{"first":"William","last":"Verts"},"email":"verts@cs.umass.edu","phone":"(413) 545-1719","tags":[],"office":"A357 LGRC","website":"http://www.cs.umass.edu/~verts/","webpage":"https://www.cics.umass.edu/faculty/directory/verts_william","interests":"","research":"","activities":[],"rating":4.1,"difficulty":2.5,"reviews":171,"id":"verts-william","courses":[]},{"name":{"first":"Arun","last":"Venkataramani"},"email":"arun@cs.umass.edu","phone":"(413) 545-3651","tags":[],"office":"236 CS Building","website":"http://www.cs.umass.edu/~arun/","webpage":"https://www.cics.umass.edu/faculty/directory/venkataramani_arun","interests":"Distributed Systems and Networking.","research":"","activities":[],"rating":1.8,"difficulty":4.6,"reviews":57,"id":"venkataramani-arun","courses":[]},{"name":{"first":"Laure","last":"Thompson"},"email":"laurejt@cs.umass.edu","phone":null,"tags":[],"office":"A217F LGRC","website":"https://people.cs.umass.edu/~laurejt/","webpage":"https://www.cics.umass.edu/people/thompson-laure","interests":"Natural language processing, machine learning, digital humanities, computational social science","research":"Laure Thompson's research bridges machine learning and natural language processing with humanistic scholarship. She builds tools and creates methodologies that enable scholars to use machine learning and statistical methods for studying humanities collections at scale. Her research focuses on understanding what computational models actually learn and how we can intentionally change what they learn. Since her work is centered on humanities applications, she works with a wide range of cultural heritage corpora: from texts of science fiction novels and medieval manuscripts to images of avant-garde journals and magical gems from the ancient Mediterranean.","activities":[],"rating":1.1,"difficulty":4.6,"reviews":8,"id":"thompson-laure","courses":[]},{"name":{"first":"Michelle","last":"Trim"},"email":"mtrim@cs.umass.edu","phone":"(413) 545-4450","tags":[],"office":"A347 LGRC","website":"http://www.cics.umass.edu/~mtrim","webpage":"https://www.cics.umass.edu/faculty/directory/trim_michelle","interests":"","research":"","activities":[],"rating":2,"difficulty":3.1,"reviews":33,"id":"trim-michelle","courses":[]},{"name":{"first":"Hanna","last":"Wallach"},"email":"wallach@cs.umass.edu","phone":null,"tags":[],"office":null,"website":"http://www.cs.umass.edu/~wallach","webpage":"https://www.cics.umass.edu/faculty/directory/wallach_hanna","interests":"Computational Social Science, Machine Learning Analysis of Structured\nand Unstructured Data, Bayesian Statistics","research":"Professor Wallach's primary research goal is to develop new mathematical models and computational tools for analyzing vast quantities of structured and unstructured data in order to identify and answer social science questions. Specifically, she is interested in analyzing complex data regarding communication and collaboration within scientific and technological innovation communities, in order to advance the study of science and innovation policy. To this end, she works on techniques for aggregating and representing amounts of information from multiple data sources with disparate emphases, methods for analyzing relational and social network data, efficient algorithms for inference, and robust methods for reasoning under uncertain information. Professor Wallach's research contributes to machine learning, Bayesian statistics, and, in collaboration with social scientists, to the nascent fields of science and innovation policy and, more generally, computational social science.","activities":[],"rating":4,"difficulty":4,"reviews":3,"id":"wallach-hanna","courses":[]},{"name":{"first":"Michael","last":"Zink"},"email":"zink@ecs.umass.edu","phone":"(413) 545-4465","tags":[],"office":"ECE","website":"http://www.ecs.umass.edu/index.pl?id=6263&isa=Category&op=show","webpage":"https://www.cics.umass.edu/faculty/directory/zink_michael","interests":"Integrative Systems Engineering, sense-and-response sensor networks, sensor virtualization, distribution of high-bandwidth, high-volume data, the design and analysis of long-distance wireless networks, and network measurements","research":"He works in the fields of sensor and distribution networks for high bandwidth data. Further research interests are in wide-area multimedia distribution for wired and wireless environments and network protocols. He is one of the developers of the KOMSSYS streaming platform.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"zink-michael","courses":[]},{"name":{"first":"Hao","last":"Zhang"},"email":"hao.zhang@umass.edu","phone":null,"tags":[],"office":"A357 LGRC","website":"https://hcr.cs.umass.edu/people/hzhang","webpage":"https://www.cics.umass.edu/people/zhang-hao","interests":"Robotics, lifelong autonomy, human-robot teaming, and robot learning and adaptation.","research":"Professor Zhang's research focuses on lifelong collaborative autonomy, with the goals to enable intelligent robots to operate over long periods of time and naturally collaborate with humans and adaptively work with other robots as teammates. His research specifically addresses introspective adaptation, context-aware navigation, multirobot collaboration, and peer-to-peer human-robot teaming in unstructured, dynamic, novel, and potentially adversarial environments. Professor Zhang is also interested in interdisciplinary research to develop fundamentally new concepts and systems that can be demonstrated on real robots in real-world applications, such as manufacturing, connected autonomous driving, robot-assisted inspection and repair, environment exploration and monitoring, and internet of robotic things. Broadly, Professor Zhang's expertise lies at the intersection of robotics, artificial intelligence, and machine learning.","activities":[],"rating":null,"difficulty":null,"reviews":null,"id":"zhang-hao","courses":[]},{"name":{"first":"Philip","last":"Thomas"},"email":"pthomas@cs.umass.edu","phone":null,"tags":[],"office":"A353A LGRC","website":"http://psthomas.com","webpage":"https://www.cics.umass.edu/people/thomas-philip","interests":"Reinforcement learning, decision making, and AI safety.","research":"Professor Thomas's research interests are in reinforcement learning, decision making, and AI safety. He is most interested in designing reinforcement learning algorithms that are more biologically plausible than existing algorithms, or which provide various forms of safety guarantees that make them viable for high-risk applications (e.g., medical applications). Towards these goals he has performed extensive work on (high-confidence) off-policy policy evaluation methods, with preliminary experiments for both digital marketing and medical applications. He has also studied methods for performing deep reinforcement learning without the need for the biologically implausible propagation of information backwards through the neural network.","activities":[],"rating":3.6,"difficulty":4.3,"reviews":12,"id":"thomas-philip","courses":[]},{"name":{"first":"Yair","last":"Zick"},"email":"yzick@cs.umass.edu","phone":null,"tags":[],"office":"A217C LGRC","website":"https://people.cs.umass.edu/~yzick/","webpage":"https://www.cics.umass.edu/people/zick-yair","interests":"Game theory, fair division, strategic collaborative behavior, and their applications in various domains. Also interested in algorithmic transparency, and ethics in AI/ML.","research":"Yair Zick is currently working on a variety of topics at the intersection of game theory, fair division and AI. His core interests are in computational aspects of game theory and fair division. Currently, he works on the fair allocation of indivisible resources, with a particular focus on justice criteria such as envy-freeness, stability and diversity. He is also interested in making machine learning models more trustworthy, by ensuring that we can explain their decisions in a reasonable manner, while preserving other criteria such as fairness and privacy. Finally, he is interested in applying machine learning concepts to game theory, in particular in how learning-theoretic concepts can be applied to obtain data-driven solutions to problems in game theory and economics.","activities":[],"rating":4,"difficulty":3.5,"reviews":2,"id":"zick-yair","courses":[]},{"name":{"first":"Shlomo","last":"Zilberstein"},"email":"shlomo@cs.umass.edu","phone":"(413) 545-4189","tags":[],"office":"A359 LGRC","website":"https://groups.cs.umass.edu/shlomo/","webpage":"https://www.cics.umass.edu/faculty/directory/zilberstein_shlomo","interests":"Artificial intelligence, automated planning, decision theory, autonomous agents and multi-agent systems, resource-bounded reasoning, metacognition, heuristic search, combinatorial optimization, reinforcement learning.","research":"Professor Zilberstein's research in artificial intelligence is focused on the computational foundations of automated reasoning and action. He studies the implications of uncertainty and limited computational resources on the design of autonomous agents. In most practical settings, it is not feasible to find optimal plans or actions, making it necessary to resort to some form of approximate reasoning. This raises a simple fundamental question: what does it mean for an agent to be \"rational\" when it does not have enough knowledge or computational power to derive the best course of action? Professor Zilberstein's approach to this problem is based on probabilistic reasoning and decision-theoretic principles, used both to develop planning algorithms and to monitor their execution and maximize the value of computation. He has developed meta-level control mechanisms that reason explicitly about the cost of decision-making and can optimize the amount of deliberation (or \"thinking\") an agent does before taking action. This research spans both theoretical issues and the development of effective algorithms and applications. Zilberstein's most recent work has produced new models and algorithms to tackle these challenges in situations involving multiple decision makers operating in either collaborative or adversarial domains.","activities":[],"rating":3.4,"difficulty":3.3,"reviews":9,"id":"zilberstein-shlomo","courses":[]},{"name":{"first":"Rui","last":"Wang"},"email":"ruiwang@cs.umass.edu","phone":"(413) 545-3147","tags":[],"office":"270 CS Building","website":"http://www.cs.umass.edu/~ruiwang/","webpage":"https://www.cics.umass.edu/faculty/directory/wang_rui","interests":"Computer graphics, global illumination algorithms, real-time rendering, graphics hardware, 3D scanning and image processing","research":"Professor Wang's research interests are in computer Graphics: Global Illumination Algorithms, Real-Time Rendering, 3D Scanning and Reconstruction, Graphics Hardware, Image Processing. His dissertation research focuses on developing new interactive techniques for high-quality, realistic image synthesis using wavelet-based precomputation.","activities":[],"rating":4.3,"difficulty":3.8,"reviews":68,"id":"wang-rui","courses":[]}]}